BookLibrary/app/controllers/book_controller.rb

SELECT "subjects".* FROM "subjects"
---
  def new
    @book = Book.new
    @subjects = Subject.all

INSERT INTO "books" ("title", "price", "subject_id", "description", "created_at") VALUES (?, ?, ?, ?, ?)  [["title", "TYk"], ["price", 120.0], ["subject_id", 2], ["description", "Genre"], ["created_at", "2016-10-10 08:21:55.182489"]]
---
  def create
    @book = Book.new(book_params)

    if @book.save